let app = new Vue({
    el: "#list",
    data: {
        categories: [
            {id: 1, name: "Базовое", links: [
                {href: "bubble-sort", name: "Сортировка пузырьком"},
                {href: "merge-sort", name: "Базовая сортировка"},
                {href: "#", name: "Структуры данных"},
                {href: "#", name: "STL C++"},
                {href: "#", name: "Жадные алгоритмы"},
                {href: "#", name: "Бинарный поиск"},
                {href: "#", name: "Тернарный поиск"},
                {href: "#", name: "Правильные скобочные последовательности"},
                {href: "#", name: "Шахматы"},
                {href: "#", name: "НВП"}
            ]},
            {id: 2, name: "Графы", links: [
                {href: "#", name: "База (представление графа)"},
                {href: "#", name: "DFS"},
                {href: "#", name: "BFS"},
                {href: "#", name: "Мосты, точки сочлинения, КСС"},
                {href: "#", name: "LCA"},
                {href: "#", name: "Алгоритм Дейкстры"},
                {href: "#", name: "Алгоритм Форда-Беллмана"},
                {href: "#", name: "Алгоритм Флойда"},
                {href: "#", name: "Алгоритм Прима"},
                {href: "#", name: "Алгоритм Краскала"},
                {href: "#", name: "Потоки"}
            ]},
            {id: 3, name: "Динамическое программирование", links: [
                {href: "#", name: "База"},
                {href: "#", name: "Задачи о кузнечике"},
                {href: "#", name: "Задачи о рюкзаке"},
                {href: "#", name: "Оптимизации ДП"}
            ]},
            {id: 4, name: "Структуры данных", links: [
                {href: "#", name: "Бинарное дерево поиска"},
                {href: "#", name: "Дерево отрезков"},
                {href: "#", name: "Декартово дерево по явному ключу"},
                {href: "#", name: "Декартово дерево по неявному ключу"},
                {href: "#", name: "Sparce table"},
                {href: "#", name: "SQRT декомпозиция"},
                {href: "#", name: "Бор"}
            ]},
            {id: 5, name: "Строки", links: [
                {href: "#", name: "prefix функция"},
                {href: "#", name: "suffix функция"},
                {href: "#", name: "Хеш-таблица"},
                {href: "#", name: "Бор"}
            ]},
            {id: 6, name: "Геометрия", links: [
                {href: "#", name: "База (представление вектора, точки и т.п.)"},
                {href: "#", name: "Всё о векторах"},
                {href: "#", name: "Площадь многоугольника"},
                {href: "#", name: "Принадлежность точки многоугольнику"},
                {href: "#", name: "Минимальная выпуклая оболочка"},
                {href: "#", name: "Пересечение окружностей"},
                {href: "#", name: "Касательные и окружности"}
            ]}
        ]
    }
});